# Задание 1

_str = 'string'
_int = 41
_float = 3.14
_bool = True

print(f'{_str}, {_int}, {_float}, {_bool}')

get_str = input('Введите строку: ')
get_inum = int(input('Введите целое число: '))
get_fnum = float(input('Введите вещественное число (через точку): '))

print(f'{get_str}, {get_inum}, {get_fnum}')
